<!-- dflook/terraform-github-actions {"workspace":"pr_comment_approved-2","backend":"736cc8f8e2ba9ee9f2bc8a551fd82bde90de7411d728e9889530928964dc0218","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #48 at https://github.com/dflook/terraform-github-actions/actions/runs/2799647086","plan_hash":"d7af72abb8514b2b3ae45272a2d5c5118804222f1eaf856bc41adce3dc9252cc"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __pr_comment_approved-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #48](https://github.com/dflook/terraform-github-actions/actions/runs/2799647086)